{"title": "2 bedroom barn conversion for sale", "price": 245000, "price_text": "£245,000", "address": "Dean, Shepton Mallet, BA4", "description": "A charming converted barn in a courtyard setting that offers versatile accommodation suited to a variety of requirements.", "link": "https://www.rightmove.co.uk/properties/147222065#/?channel=RES_BUY"}
{"title": "2 bedroom bungalow for sale", "price": 240000, "price_text": "£240,000", "address": "Alnwick, Toothill, Swindon, Wiltshire, SN5", "description": "** THIS PROPERTY SUFFERS FROM SUBSIDENCE **OFFERED FOR SALE WITH NO ONWARD CHAIN** This two bedroom detached bungalow is nestled away in a corner plot location on the sought after road of Alnwick in Toothill Swindon. This property offers excellent living space, a generous p...", "link": "https://www.rightmove.co.uk/properties/144152003#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 240000, "price_text": "£240,000", "address": "Renard Rise, Stonehouse, Gloucestershire, GL10", "description": "A spacious two bedroom detached coach house with off road parking and a garage. Discreetly located in a tucked away position within close proximity to local amenities, playground and town centre. Internally this light and airy home comprises of an entrance hall with stairs leading up ...", "link": "https://www.rightmove.co.uk/properties/147721130#/?channel=RES_BUY"}
{"title": "2 bedroom bungalow for sale", "price": 240000, "price_text": "£240,000", "address": "Hill Street, Kingswood, Bristol, BS15", "description": "Public Notice - We advise that an offer has been made for the property in the sum of £230,000. Any persons wishing to increase on this offer should notify the agents of their best offer prior to exchange of contracts - CJ Hole Kingswood - Offering spacious accommodat...", "link": "https://www.rightmove.co.uk/properties/145646810#/?channel=RES_BUY"}
{"title": "3 bedroom cottage for sale", "price": 240000, "price_text": "£240,000", "address": "Main Road, Woodford, GL13", "description": "Perfect for those looking for a character family home with private garden, and investors looking for plenty of opportunity to extend and add value. Being Sold via Secure sale online Bidding. Terms & Conditions Apply. Starting Bid £240,000", "link": "https://www.rightmove.co.uk/properties/149509904#/?channel=RES_BUY"}
{"title": "1 bedroom bungalow for sale", "price": 239950, "price_text": "£239,950", "address": "Southfield Road, Nailsea", "description": "A very deceptive one bedroom bungalow in a level setting with a variety of improvements and the added advantage of an attic room that is currently used as an additional bedroom. The original accommodation offers good space and benefits from being light and airy. The bungalow has also been upd...", "link": "https://www.rightmove.co.uk/properties/150397721#/?channel=RES_BUY"}
{"title": "2 bedroom bungalow for sale", "price": 237500, "price_text": "£237,500", "address": "Chaingate Court, Glastonbury, BA6", "description": "Situated in a secluded position and accessed via a gated entrance, this unique chalet style property features a charming courtyard garden and has the benefit of no onward chain. The property would make an excellent investment or suit those requiring a property with easy maintenance close ...", "link": "https://www.rightmove.co.uk/properties/148084376#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 235000, "price_text": "£235,000", "address": "Yarley (Between Wells and Wedmore)", "description": "OFFERS INVITED! A lovely two bedroom detached cottage set in a beautiful riverside location with a large sitting room and generous kitchen / dining area. There is a low maintenance patio garden with a river view and parking for one car. Ideal as a lock up and leave, bolt hole or holiday let.", "link": "https://www.rightmove.co.uk/properties/143868791#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 235000, "price_text": "£235,000", "address": "Dione Crescent, Swindon, Wiltshire, SN25", "description": "Offered for sale with NO ONWARD CHAIN is this WELL PRESENTED, SPACIOUS, FREEHOLD COACH HOUSE. Situated in a well-regarded road within Oakhurst, sole agent Charles Harding strongly recommend an internal viewing to fully appreciate the space on offer. The accommodation briefly comprises of 2 bedro...", "link": "https://www.rightmove.co.uk/properties/149774495#/?channel=RES_BUY"}
{"title": "3 bedroom cottage for sale", "price": 230000, "price_text": "£230,000", "address": "Main Road, Woodford, Berkeley, Gloucestershire, GL13 9JN", "description": "Interior As you approach the double-fronted exterior, you are greeted by an inviting entrance hall that sets the tone for the home's period charm. The dining room exudes warmth and character, featuring deep skirting boards and picture rails that accentuate the space's historical eleganc...", "link": "https://www.rightmove.co.uk/properties/86903979#/?channel=RES_BUY"}
{"title": "1 bedroom bungalow for sale", "price": 230000, "price_text": "£230,000", "address": "Brook Cottage, Lower Common, Aylburton, Lydney", "description": "A charming detached one bedroom bungalow, situated within a picturesque semi-rural valley location with off road parking, a variety of county walks, income generating solar panels and close proximity to the A48 and greater travel networks. Offered with no onward chain.", "link": "https://www.rightmove.co.uk/properties/148406387#/?channel=RES_BUY"}
{"title": "3 bedroom link detached house for sale", "price": 230000, "price_text": "£230,000", "address": "Chiltern Close, Warminster", "description": "This spacious family Home is within a comfortable walking distance of Schooling, the Railway Station, Town Centre and close to extensive public open space.Hall, Cloakroom, Study/Bedroom 4, Sitting Room, Dining Room, Conservatory, Kitchen, First Floor Landing, Shower Room & 3 Bedrooms, Easil...", "link": "https://www.rightmove.co.uk/properties/148891685#/?channel=RES_BUY"}
